# Создайте программу (можно взять любой прошлый проект) при помощи виртуального окружения и PIP(в семинаре все обсудили по этому поводу).

# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример: - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
# from random import randint
# from isOdd import isOdd
# numbers = [randint(0, 100) for i in range(4)]
# print (f"Список - {numbers}") 
# print (f"Сумма цифр на нечётных позициях = {sum(numbers[i] for i in range(len(numbers)) if isOdd(i))}") 
